app/controllers/doctors/sessions_controller.rb

    def create
    @accountant = Doctor.find_by_email(user_params[:email])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."email" = ? LIMIT ?  [["email", "leroyombiji@gmail.com"], ["LIMIT", 1]]