app/controllers/admin/sessions_controller.rb

  def create
    @admin = Admin.find_by_email(user_params[:email])
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "morty@gmail.com"], ["LIMIT", 1]]