app/controllers/managers/sessions_controller.rb

SELECT "managers".* FROM "managers" WHERE "managers"."email" = ? LIMIT ?  [["email", "galileo@galileo.math"], ["LIMIT", 1]]
---
  def create
    @manager = Manager.find_by_email(user_params[:email])