app/controllers/users/devise/sessions_controller.rb

  def create
    @admin = User.find_by_email(user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bofulo@gmail.com"], ["LIMIT", 1]]