app/controllers/managers_controller.rb

SELECT "managers".* FROM "managers"
---
        def index
            manager = Manager.all