app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)

    if @patient.save
---
INSERT INTO "patients" ("ticket_no", "username", "patient_no", "reg_date", "address", "dob", "contact_no", "email", "guardian", "relation", "gender", "patient_status", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @patient.update(patient_params)
---
UPDATE "patients" SET "guardian" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["guardian", "leroy"], ["updated_at", "2022-10-25 12:56:52.437963"], ["id", 2]]

  def destroy
    @patient.destroy
---
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]