app/controllers/reg_forms_controller.rb

SELECT "reg_forms".* FROM "reg_forms"
---
  def index
    Reg = RegForm.all