app/controllers/staffs_controller.rb

  def index
    staffs = Staff.all
---
SELECT "staffs".* FROM "staffs"

def show
    staff = Staff.all
---
SELECT "staffs".* FROM "staffs"